#Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
#Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, 
#если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
#а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

a = int(input("Введите количество журавликов: "))
print(" Петя и Серёжа сделали по" , a/6, "журавликов")
print("Маша сделала ", a/6*4, "журавликов")